app/Controllers/Lecciones.php

SELECT *
FROM `profesores`
WHERE `prof_usua_ide` = '2'
---
    public function index()
    {
        $db = \Config\Database::connect();

        if ($this->session->perf_ide == 3) {
            // ADMIN: todos los cursos activos
            $cursos = $db->table('cursos c')
                ->select('c.curs_ide, c.curs_nombre, c.curs_nivel, u.usua_nombres, u.usua_paterno')
                ->join('profesores p','p.prof_ide=c.curs_prof_ide','left')
                ->join('usuarios u','u.usua_ide=p.prof_usua_ide','left')
                ->where('c.curs_esta_ide',1)
                ->orderBy('c.curs_nombre')
                ->get()->getResult();
        } else {
            // PROFESOR: solo sus cursos
            $prof   = $db->table('profesores')->where('prof_usua_ide', $this->session->usua_ide)->get()->getRow();