app/Controllers/Panel.php

    public function ver($curs_ide)
    {
        $db = \Config\Database::connect();
        $curso = $db->table('cursos c')
            ->select('c.*, cat.cate_nombre, u.usua_nombres, u.usua_paterno, u.usua_email, p.prof_biografia, p.prof_especialidad')
            ->join('categorias cat','cat.cate_ide=c.curs_cate_ide','left')
            ->join('profesores p','p.prof_ide=c.curs_prof_ide','left')
            ->join('usuarios u','u.usua_ide=p.prof_usua_ide','left')
            ->where('c.curs_ide', $curs_ide)->get()->getRow();

        $secciones = $db->table('secciones')->where('secc_curs_ide',$curs_ide)->orderBy('secc_orden')->get()->getResult();
        $lecciones = $db->table('lecciones')->where('lecc_curs_ide',$curs_ide)->where('lecc_esta_ide',1)->orderBy('lecc_secc_ide, lecc_orden')->get()->getResult();

        $matricula = $db->table('matriculas')
            ->where(['matr_usua_ide'=>$this->session->usua_ide,'matr_curs_ide'=>$curs_ide])->get()->getRow();

        // Progreso del alumno
        $progreso = [];
        if ($matricula) {
            $prog = $db->table('progreso')->where('prog_usua_ide',$this->session->usua_ide)->get()->getResult();
---
SELECT `c`.*, `cat`.`cate_nombre`, `u`.`usua_nombres`, `u`.`usua_paterno`, `u`.`usua_email`, `p`.`prof_biografia`, `p`.`prof_especialidad`
FROM `cursos` `c`
LEFT JOIN `categorias` `cat` ON `cat`.`cate_ide`=`c`.`curs_cate_ide`
LEFT JOIN `profesores` `p` ON `p`.`prof_ide`=`c`.`curs_prof_ide`
LEFT JOIN `usuarios` `u` ON `u`.`usua_ide`=`p`.`prof_usua_ide`
WHERE `c`.`curs_ide` = '1'
SELECT *
FROM `secciones`
WHERE `secc_curs_ide` = '1'
ORDER BY `secc_orden`
SELECT *
FROM `lecciones`
WHERE `lecc_curs_ide` = '1'
AND `lecc_esta_ide` = 1
ORDER BY `lecc_secc_ide`, `lecc_orden`
SELECT *
FROM `matriculas`
WHERE `matr_usua_ide` = '1'
AND `matr_curs_ide` = '1'
SELECT *
FROM `progreso`
WHERE `prog_usua_ide` = '1'