app/Controllers/Perfil.php

    public function ver($usua_ide)
    {
        if (!in_array($this->session->perf_ide, [3, 4])) {
            echo json_encode(['ok' => false, 'html' => '<p>Sin acceso.</p>']);
            return;
        }

        $db      = \Config\Database::connect();
        $usuario = $db->table('usuarios u')
            ->select('u.*, p.perf_nombre')
            ->join('perfiles p', 'p.perf_ide=u.usua_perf_ide', 'left')
            ->where('u.usua_ide', (int)$usua_ide)
            ->get()->getRow();

        if (!$usuario) {
            echo json_encode(['ok' => false, 'html' => '<p>Usuario no encontrado.</p>']);
            return;
        }

        // Datos extra según perfil
        $extra   = null;
        $aluInfo = null;

        if ($usuario->usua_perf_ide == 2) {
            $extra = $db->table('profesores')->where('prof_usua_ide', $usua_ide)->get()->getRow();
        } elseif ($usuario->usua_perf_ide == 1) {
            $extra   = $db->table('perfil_alumno')->where('pale_usua_ide', $usua_ide)->get()->getRow();
            $aluInfo = $db->table('alumno_info ai')
                ->select('ai.*, u2.ugel_nombre, u2.ugel_ciudad, c.cole_nombre, c.cole_ciudad, ai.alui_cole_texto, ai.alui_sin_colegio')
                ->join('ugeles u2',  'u2.ugel_ide=ai.alui_ugel_ide', 'left')
                ->join('colegios c', 'c.cole_ide=ai.alui_cole_ide',  'left')
                ->where('ai.alui_usua_ide', $usua_ide)
                ->get()->getRow();
---
SELECT `u`.*, `p`.`perf_nombre`
FROM `usuarios` `u`
LEFT JOIN `perfiles` `p` ON `p`.`perf_ide`=`u`.`usua_perf_ide`
WHERE `u`.`usua_ide` = 12
SELECT *
FROM `perfil_alumno`
WHERE `pale_usua_ide` = '12'
SELECT `ai`.*, `u2`.`ugel_nombre`, `u2`.`ugel_ciudad`, `c`.`cole_nombre`, `c`.`cole_ciudad`, `ai`.`alui_cole_texto`, `ai`.`alui_sin_colegio`
FROM `alumno_info` `ai`
LEFT JOIN `ugeles` `u2` ON `u2`.`ugel_ide`=`ai`.`alui_ugel_ide`
LEFT JOIN `colegios` `c` ON `c`.`cole_ide`=`ai`.`alui_cole_ide`
WHERE `ai`.`alui_usua_ide` = '12'

        // Estadísticas
        $stats = [];
        if ($usuario->usua_perf_ide == 1) {
            $stats['cursos'] = $db->table('matriculas')
                ->where('matr_usua_ide', $usua_ide)->where('matr_esta_ide', 1)->countAllResults();
            $stats['completados'] = $db->table('matriculas')
                ->where('matr_usua_ide', $usua_ide)->where('matr_completado', 1)->countAllResults();
            $stats['lecciones'] = $db->table('progreso')
                ->where('prog_usua_ide', $usua_ide)->where('prog_completado', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `matriculas`
WHERE `matr_usua_ide` = '12'
AND `matr_esta_ide` = 1
SELECT COUNT(*) AS `numrows`
FROM `matriculas`
WHERE `matr_usua_ide` = '12'
AND `matr_completado` = 1
SELECT COUNT(*) AS `numrows`
FROM `progreso`
WHERE `prog_usua_ide` = '12'
AND `prog_completado` = 1